[M_ColdShoulder MissionDefinition]
MissionDescription="Scooter's girlfriend, Laney, has been brainwashed into becoming a tunnel rat. Scooter has asked you to bring Laney's favorite flowers and food to her in [place]The Fridge[-place], in the hopes of turning her back into a normal, non-cannibalistic human being. "
TurnInDescription="It appears that Laney preferred a life of solitude and cannibalism over spending another minute in the presence of Scooter or his friends."
